#Напишіть програму Python, щоб роздрукувати всі парні числа із заданого списку чисел у тому самому порядку та зупинити друк, 
#якщо в послідовності є числа, що приходять після 237.

numbers = [    
    386, 462, 47, 418, 907, 344, 236, 375, 823, 566, 597, 978, 328, 615, 953, 345, 
    399, 162, 758, 219, 918, 237, 412, 566, 826, 248, 866, 950, 626, 949, 687, 217, 
    815, 67, 104, 58, 512, 24, 892, 894, 767, 553, 81, 379, 843, 831, 445, 742, 717, 
    958,743, 527
]

https://www.programiz.com/python-programming/examples/calculator

Напишіть функцію score(pupil, hw, exam), яка приймає на вхід ім'я учня(pupil),
кортеж, що містить його оцінки за домашні завдання (hw), а також його оцінку за іспит (exam), 
і видає рядок  pupil, твоя загальна оцінка grade.
pupil-ім'я учня;
grade - його підсумкова оцінка за курс, що є цілим числом. 
Відомо, що підсумкова оцінка обраховується так: Підсумок = 0.4 * ДЗ + 0.6 * exam,
де ДЗ - середнє арифметичне оцінок за домашні завдання. Підсумок повинен бути заокруглений до цілого числа. 

приклад: score( "Іван", (7, 7, 5, 9, 5, 2), 6) 

Іван, твоя загальна оцінка  6.
